{
  "entries": [
    {
      "id": "2025-10-03-haazinu-yair",
      "parsha": "Ha'azinu",
      "title": "Gratitude and Humility in Times of Plenty",
      "sharedOn": "2025-10-03",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair reflects on Moshe's final song as a warning against spiritual complacency. His core message: gratitude protects us from entitlement, and humility keeps us grounded when life is going well."
    },
    {
      "id": "2025-10-03-haazinu-aidan",
      "parsha": "Ha'azinu",
      "title": "Timely Faith and Courage in London",
      "sharedOn": "2025-10-03",
      "writtenBy": "Aidan Schurr",
      "sharedBy": "Aidan Schurr",
      "excerpt": "Aidan connects the week's parsha to rising hostility in London and shares a call to remain proud, connected, and spiritually close even across distance."
    },
    {
      "id": "2025-10-03-haazinu-naama",
      "parsha": "Ha'azinu",
      "title": "Seeking Good Despite the Bad",
      "sharedOn": "2025-10-03",
      "writtenBy": "Naama Ben-Dor",
      "sharedBy": "Naama Ben-Dor",
      "excerpt": "Naama emphasizes the discipline of finding good even in difficult moments, and the strength that comes from remembering we are never alone in success or failure."
    },
    {
      "id": "2025-10-03-haazinu-lori",
      "parsha": "Ha'azinu",
      "title": "Trusting the Path We Were Given",
      "sharedOn": "2025-10-03",
      "writtenBy": "Lori Preci",
      "sharedBy": "Lori Preci",
      "excerpt": "Lori reflects on Moshe at the burning bush and the comfort of trusting that God's plan can exceed personal understanding, especially when life's path feels uncertain."
    },
    {
      "id": "2025-10-10-sukkot-yair",
      "parsha": "Sukkot / Golden Calf Reading",
      "title": "Mercy, Repair, and Courage After Fracture",
      "sharedOn": "2025-10-10",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair reads Moshe's plea after the Golden Calf as a guide for our time: imitate divine mercy, strengthen solidarity, and become agents of light in a fractured world."
    },
    {
      "id": "2025-10-10-sukkot-erez",
      "parsha": "Sukkot / Golden Calf Reading",
      "title": "Loyalty After Betrayal",
      "sharedOn": "2025-10-10",
      "writtenBy": "Erez Yarden",
      "sharedBy": "Erez Yarden",
      "excerpt": "Erez focuses on the danger of betrayal in the Golden Calf episode and draws a practical takeaway: loyalty to God and values is non-negotiable."
    },
    {
      "id": "2025-10-10-sukkot-aidan",
      "parsha": "Sukkot / Golden Calf Reading",
      "title": "Ushpizin as a Blueprint for Character",
      "sharedOn": "2025-10-10",
      "writtenBy": "Aidan Schurr",
      "sharedBy": "Aidan Schurr",
      "excerpt": "Aidan shares lessons from the seven Ushpizin virtues and frames Sukkot as training for rebuilding a better world through loyalty, faith, and action."
    },
    {
      "id": "2025-10-10-sukkot-lori",
      "parsha": "Sukkot / Golden Calf Reading",
      "title": "Moses and the Leadership of Letting Go",
      "sharedOn": "2025-10-10",
      "writtenBy": "Lori Preci",
      "sharedBy": "Lori Preci",
      "excerpt": "Lori reflects on Moses not entering the land as a divine transition: true leadership sometimes means planting seeds for a future one may never personally enter."
    },
    {
      "id": "2025-10-17-bereshit-yair",
      "parsha": "Bereshit",
      "title": "Creation as a Shared Project",
      "sharedOn": "2025-10-17",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair highlights language as creative power and argues that God left creation unfinished so humanity can partner in Tikkun Olam through daily acts of responsibility."
    },
    {
      "id": "2025-10-17-bereshit-naama",
      "parsha": "Bereshit",
      "title": "Justice, Choice, and Moral Agency",
      "sharedOn": "2025-10-17",
      "writtenBy": "Naama Ben-Dor",
      "sharedBy": "Naama Ben-Dor",
      "excerpt": "Naama traces responsibility from Adam and Eve to Cain and Abel, emphasizing that emotions are powerful but choices remain ours, and justice is not the same as retaliation."
    },
    {
      "id": "2025-10-17-bereshit-aidan",
      "parsha": "Bereshit",
      "title": "Duality and the Choice to Begin Again",
      "sharedOn": "2025-10-17",
      "writtenBy": "Aidan Schurr",
      "sharedBy": "Aidan Schurr",
      "excerpt": "Aidan explores duality in Bereshit and calls for renewed covenantal commitment, choosing growth and responsibility over repetition of old patterns."
    },
    {
      "id": "2025-10-24-noach-yair",
      "parsha": "Noach",
      "title": "Beyond Chaos and Conformity",
      "sharedOn": "2025-10-24",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair contrasts the selfish violence of the flood generation with the ego-driven conformity of Babel, and frames Abraham's path as principled action with higher purpose."
    },
    {
      "id": "2025-10-24-noach-naama",
      "parsha": "Noach",
      "title": "Human Imperfection and Divine Persistence",
      "sharedOn": "2025-10-24",
      "writtenBy": "Naama Ben-Dor",
      "sharedBy": "Naama Ben-Dor",
      "excerpt": "Naama reads God's post-flood promise as recognition of human imperfection alongside ongoing moral responsibility, agency, and the call to choose wisely."
    },
    {
      "id": "2025-10-31-lechlecha-yair",
      "parsha": "Lech-Lecha",
      "title": "Lech Lecha as a Journey to the Self",
      "sharedOn": "2025-10-31",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair frames Lech Lecha as spiritual individuation: leaving inherited identities, standing apart with integrity, and refusing to let corrupt systems define success."
    },
    {
      "id": "2025-10-31-lechlecha-daniel",
      "parsha": "Lech-Lecha",
      "title": "From Abram to Abraham",
      "sharedOn": "2025-10-31",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel reflects on the letter-hei added to Abraham's name as symbol of expanded mission: from private faith to covenantal responsibility for generations."
    },
    {
      "id": "2025-10-31-lechlecha-aidan",
      "parsha": "Lech-Lecha",
      "title": "Counting the Stars as a Calling",
      "sharedOn": "2025-10-31",
      "writtenBy": "Aidan Schurr",
      "sharedBy": "Aidan Schurr",
      "excerpt": "Aidan interprets \"count the stars\" as a perpetual Jewish mission to pursue justice, goodness, and love even when outcomes seem improbable."
    },
    {
      "id": "2025-10-31-lechlecha-lori",
      "parsha": "Lech-Lecha",
      "title": "Knowing God's Will and Living It",
      "sharedOn": "2025-10-31",
      "writtenBy": "Lori Preci",
      "sharedBy": "Lori Preci",
      "excerpt": "Lori explores Abraham's missteps and growth, showing that covenantal life matures through persistence and trust, not perfection."
    },
    {
      "id": "2025-10-31-lechlecha-naama",
      "parsha": "Lech-Lecha",
      "title": "Jealousy, Endurance, and Faith",
      "sharedOn": "2025-10-31",
      "writtenBy": "Naama Ben-Dor",
      "sharedBy": "Naama Ben-Dor",
      "excerpt": "Naama reflects on Sarai and Hagar to draw lessons about jealousy, dignity under adversity, and maintaining faith even when circumstances feel unjust."
    },
    {
      "id": "2025-11-07-vayera-yair",
      "parsha": "Vayera",
      "title": "Chesed Needs Moral Clarity",
      "sharedOn": "2025-11-07",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair contrasts Abraham and Lot to argue that kindness without an inner moral framework can collapse under pressure; true chesed must be guided by justice and wisdom."
    },
    {
      "id": "2025-11-07-vayera-naama",
      "parsha": "Vayera",
      "title": "Hineni as Response, Not Reaction",
      "sharedOn": "2025-11-07",
      "writtenBy": "Naama Ben-Dor",
      "sharedBy": "Naama Ben-Dor",
      "excerpt": "Naama reads Abraham's repeated \"Hineni\" as a model of present-tense responsibility and covenantal agency: answering life's challenges with action and humility."
    },
    {
      "id": "2025-11-07-vayera-lori",
      "parsha": "Vayera",
      "title": "Staying Yourself in Sodom",
      "sharedOn": "2025-11-07",
      "writtenBy": "Lori Preci",
      "sharedBy": "Lori Preci",
      "excerpt": "Lori uses Lot's story to examine moral compromise in hostile culture, and stresses that spiritual community is essential for preserving integrity."
    },
    {
      "id": "2025-11-07-vayera-daniel",
      "parsha": "Vayera",
      "title": "Is Anything Beyond God?",
      "sharedOn": "2025-11-07",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel focuses on Sarah's laughter and the promise of Isaac, emphasizing that human impossibility does not limit divine possibility."
    },
    {
      "id": "2025-11-14-chayeisara-yair",
      "parsha": "Chayei Sara",
      "title": "Small Requests, Great Character",
      "sharedOn": "2025-11-14",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair highlights Eliezer's test of Rivka at the well as a blueprint for lifnim mishurat hadin: true character is revealed in proactive generosity, not minimum compliance."
    },
    {
      "id": "2025-11-14-chayeisara-lori",
      "parsha": "Chayei Sara",
      "title": "Machpelah: Promise Through Responsibility",
      "sharedOn": "2025-11-14",
      "writtenBy": "Lori Preci",
      "sharedBy": "Lori Preci",
      "excerpt": "Lori analyzes Abraham's legal purchase of Machpelah as a lesson in agency, memory, and ethical process: divine promise unfolds through human responsibility."
    },
    {
      "id": "2025-11-14-chayeisara-daniel",
      "parsha": "Chayei Sara",
      "title": "Wisdom Is Also Doing",
      "sharedOn": "2025-11-14",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel shares a childhood maxim in Hebrew: wisdom is not only speaking, but acting."
    },
    {
      "id": "2025-11-21-toldot-yair",
      "parsha": "Toldot",
      "title": "Wrestling as the Birth of Identity",
      "sharedOn": "2025-11-21",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair turns Toldot into a theology of struggle: conflict is not failure but formation, and resilience is re-digging wells when life fills them with dirt."
    },
    {
      "id": "2025-11-21-toldot-lori",
      "parsha": "Toldot",
      "title": "Ends, Means, and Moral Formation",
      "sharedOn": "2025-11-21",
      "writtenBy": "Lori Preci",
      "sharedBy": "Lori Preci",
      "excerpt": "Lori engages Rabbi Sacks on Jacob's blessing: does destiny justify deception, or does method still define character?"
    },
    {
      "id": "2025-11-21-toldot-daniel",
      "parsha": "Toldot",
      "title": "Inner Battle and Lasting Purpose",
      "sharedOn": "2025-11-21",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel contrasts short-term gratification with covenantal mission and frames Jacob/Esau as the ongoing human struggle between impulse and purpose."
    },
    {
      "id": "2025-11-28-vayetzei-yair",
      "parsha": "Vayetzei",
      "title": "The Ladder in Liminal Space",
      "sharedOn": "2025-11-28",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair reads Jacob's ladder as a map for resilience: moments of isolation can become foundations of holiness when we keep moving up after every descent."
    },
    {
      "id": "2025-12-05-vayishlach-yair",
      "parsha": "Vayishlach",
      "title": "Rav vs Kol: Much vs Everything",
      "sharedOn": "2025-12-05",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair contrasts Esau's \"I have much\" with Jacob's \"I have everything\" to distinguish endless accumulation from contented wholeness."
    },
    {
      "id": "2025-12-05-vayishlach-naama",
      "parsha": "Vayishlach",
      "title": "Fear as a Doorway to Courage",
      "sharedOn": "2025-12-05",
      "writtenBy": "Naama Ben-Dor",
      "sharedBy": "Naama Ben-Dor",
      "excerpt": "Naama, drawing on Rashbam and Rabbi Sacks, reframes fear as the arena in which courage is chosen, not the sign that courage is absent."
    },
    {
      "id": "2025-12-05-vayishlach-lori",
      "parsha": "Vayishlach",
      "title": "Power, Ethics, and the Dinah Narrative",
      "sharedOn": "2025-12-05",
      "writtenBy": "Lori Preci",
      "sharedBy": "Lori Preci",
      "excerpt": "Lori reflects on the Dinah episode through the lens of social power, asking how communities pursue justice without becoming what they resist."
    },
    {
      "id": "2025-12-06-vayishlach-daniel",
      "parsha": "Vayishlach",
      "title": "Gratitude Before Resolution",
      "sharedOn": "2025-12-06",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel highlights Jacob's humility before meeting Esau: gratitude in uncertainty is a deeper spiritual discipline than gratitude after success."
    },
    {
      "id": "2025-12-12-vayeshev-yair",
      "parsha": "Vayeshev",
      "title": "Identity Beyond the Garment",
      "sharedOn": "2025-12-12",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair ties Joseph's stripped garments to Hanukkah's core lesson: external symbols can be taken, but covenantal identity and soul cannot be stripped away."
    },
    {
      "id": "2025-12-13-vayeshev-daniel",
      "parsha": "Vayeshev",
      "title": "Joseph Part I: God in the Pit",
      "sharedOn": "2025-12-13",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel retells Joseph's early descent from jealousy to prison, centering the recurring Torah refrain that God remained with Joseph throughout."
    },
    {
      "id": "2025-12-14-hanukkah-yair",
      "parsha": "Hanukkah Reflection",
      "title": "Answering Darkness with More Light",
      "sharedOn": "2025-12-14",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "In response to the Sydney tragedy, Yair writes that Jewish resilience requires intensified life, celebration, and moral clarity: fight darkness with light."
    },
    {
      "id": "2025-12-14-hanukkah-erez",
      "parsha": "Hanukkah Reflection",
      "title": "The Dawn After the Darkest Hour",
      "sharedOn": "2025-12-14",
      "writtenBy": "Erez Yarden",
      "sharedBy": "Erez Yarden",
      "excerpt": "Erez connects Tamar's narrative to the idea that renewal follows darkness, and expresses hope through global Jewish solidarity after anti-Jewish violence."
    },
    {
      "id": "2025-12-14-hanukkah-aidan",
      "parsha": "Hanukkah Reflection",
      "title": "Hope as Collective Responsibility",
      "sharedOn": "2025-12-14",
      "writtenBy": "Aidan Schurr",
      "sharedBy": "Aidan Schurr",
      "excerpt": "Aidan cites Rabbi Sacks to distinguish optimism from hope, urging sustained Jewish joy, study, and communal repair even under pressure."
    },
    {
      "id": "2025-12-19-miketz-yair",
      "parsha": "Miketz",
      "title": "From Excuse to Surety",
      "sharedOn": "2025-12-19",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair focuses on Judah's transformation into guarantor for Benjamin as the turning point from self-interest to covenantal responsibility."
    },
    {
      "id": "2025-12-19-miketz-daniel",
      "parsha": "Miketz",
      "title": "Joseph Part II: Meaning After Betrayal",
      "sharedOn": "2025-12-19",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel completes Joseph's arc from dungeon to leadership and emphasizes his radical reframing: what others meant for harm, God redirected toward life."
    },
    {
      "id": "2026-01-02-vayechi-lori",
      "parsha": "Vayechi",
      "title": "Faith Without Forecasting",
      "sharedOn": "2026-01-02",
      "writtenBy": "Lori Preci",
      "sharedBy": "Lori Preci",
      "excerpt": "Lori notes that Jacob is denied full foresight yet still blesses his children, teaching that integrity in the present matters more than certainty about the future.",
      "fullText": "Hi friends!\n\nI hope your holiday season was jolly and restful, and that the new year is off to a strong start. It feels especially fitting that as one year draws to a close, we also reach the conclusion of Genesis with Parashat Vayechi.\n\nRabbi Jonathan Sacks observes that after a book shaped by conflict, whether between brothers or fathers and sons, this final portion shows a family moving toward reconciliation. Jacob is reunited with Joseph, blesses his grandsons Ephraim and Manasseh, and then offers blessings to his twelve sons before his death in Egypt. It is, in many ways, a serene ending to the book of beginnings.\n\nRabbi Sacks also observes how this moment embodies faith without foreknowledge. Jacob, on his deathbed, gathers his children and declares “Come together that I may tell you what is to befall you in days to come” (Gen 49:1). Yet tradition teaches that despite his desire to foresee the future, the Shechinah departs from him, and he cannot. Even the great patriarch is denied full knowledge of what lies ahead. At that moment, Jacob shifts from prediction to blessing, in what is an act of deeper faith.\n\nIn this sense, Vayechi teaches a powerful lesson: certainty about the future is not required to act faithfully and generously toward it. Jacob’s blessings, and Joseph’s later reassurance to his brothers that “God intended it for good” even when they intended harm (Gen 50:20), remind us that faith is lived one choice at a time, not in foresight, but in integrity, forgiveness, and trust.\n\nAs we stand at the threshold of a new year, Vayechi reminds us that we are rarely given clarity about what lies ahead. What we are given, however, is the opportunity to shape the future through the ways we speak to one another, the forgiveness we extend, and the commitments we uphold. Like Jacob and Joseph, we are asked not to foresee the future, but to act with integrity in the present.\n\nI pray that you’re all doing well!\n\nUntil Exodus...\n\nWith love,\nLorraine"
    },
    {
      "id": "2026-01-02-vayechi-yair",
      "parsha": "Vayechi",
      "title": "A Jewish Ending Is \"To Be Continued\"",
      "sharedOn": "2026-01-02",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair echoes Rabbi Sacks: Genesis ending in exile teaches that unfinished chapters can still be faithful chapters. Covenantal life continues forward.",
      "fullText": "Dear Friends (Lorainey, Aidan, Avison, Naama, Danielson, Inbar, and Erezatang),\n\nLorraine, thank you for that beautiful thought and for taking over while I am in a trip in ARGENTINAAA.\n\nIt’s so true that Parshat Vayechi is less about knowing the future and more about how we handle the end of a chapter. I loved your point about Jacob shifting from prediction to blessing. To add to that, Rabbi Sacks points out something amazing about how the book of Genesis ends. Usually, a story ends when everyone \"lives happily ever after\" or the hero gets exactly what they wanted. But Genesis ends with the Jewish people in exile in Egypt, far from the land they were promised.\nRabbi Sacks teaches that the Torah ends the book of Genesis this way to show us that a \"Jewish\" ending is never really an ending… it’s a \"to be continued.\" Even though Jacob is dying and the family is in a foreign land, the book ends with a promise and a blessing. It teaches us that we don't need a perfect, tied-up ending to have a meaningful life. As we start this new year, Vayechi reminds us that even when things feel unfinished or we aren't exactly where we thought we’d be, we can still create \"good\" through our integrity and the way we treat the people around us.\n\nWishing you all a Shabbat Shalom and a happy new yair!\n\nUntil Exodus...\n\nYair <3"
    },
    {
      "id": "2026-01-09-shemot-yair",
      "parsha": "Shemot",
      "title": "Ehyeh Asher Ehyeh and the Future We Build",
      "sharedOn": "2026-01-09",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair reads God's name \"I Will Be\" as radical future-oriented hope and links Moses' early interventions to leadership defined by moral responsibility.",
      "fullText": "Dear Friends (Lorainey, Aidan, Avison, Naama, Danielson, Inbar, and Erezatang),\n\nI hope you all had a great week and are staying warm. This Shabbat, we begin the Book of Exodus… Parsha Shemot, one of my favorites!!!\n\nIn Parshat Shemot, the atmosphere from last week changes completely. A new Pharaoh rises to power, ignores everything Joseph did for Egypt, and enslaves the Jewish people. In the middle of this tragedy, Moses is born and saved by Pharaoh’s own daughter. As Moses grows up, he begins to see the injustice around him and eventually flees to the desert of Midian after standing up for a Hebrew slave. It is there, while tending sheep, that he encounters a bush that burns but is never consumed. God speaks to him from the flames, calling him to leave his quiet life behind and return to Egypt to lead his people to freedom.\n\nAs Moses prepares for this massive mission, he asks God a very famous question: what is Your name? The response God gives is one of the most mysterious and beautiful phrases in the whole Torah:\n\nוַיֹּ֤אמֶר אֱלֹהִים֙ אֶל־מֹשֶׁ֔ה אֶֽהְיֶ֖ה אֲשֶׁ֣ר אֶֽהְיֶ֑ה וַיֹּ֗אמֶר כֹּ֤ה תֹאמַר֙ לִבְנֵ֣י יִשְׂרָאֵ֔ל אֶֽהְיֶ֖ה שְׁלָחַ֥נִי אֲלֵיכֶֽם׃\n\n\"And God said to Moses, 'I Will Be Who I Will Be.' And He said, 'Thus shall you say to the Israelites: \"I Will Be\" has sent me to you.'\" (Exodus 3:14)\n\n\nRabbi Lord Jonathan Sacks explains that this name is far more than just a label: it is a radical statement of hope. Most people think of God in the past tense or as a static, unchangeable force, but Rabbi Sacks teaches that Judaism is unique because our God is defined by the future. By calling Himself \"I Will Be,\" God is telling Moses that the future is not yet written. We are never truly trapped by our current \"exile\" or our present struggles. This name is a promise that change is always possible and that God is found in the infinite potential of what we can become.\nHowever, for this future to actually happen, someone has to step up and make it real. Before the moment at the Burning Bush, the Torah shows us three specific times where Moses intervenes in a conflict: he saves a Hebrew from an Egyptian, he tries to stop two Hebrews from fighting each other, and he protects non-Jewish women from bullying shepherds at a well. Rabbi Sacks points out that these weren't just random events: they were tests. Moses became a leader the very second he refused to be a bystander. He didn't care if the victim was his \"brother\" or a complete stranger. He simply saw an injustice and felt an instinctive drive to make it right.\n\nThe profound takeaway for our lives is that who we are is defined by the responsibility we take for the world around us. We often feel stuck in our current circumstances, believing that things are \"just the way they are.\" But when we choose to stop being bystanders, we are doing more than just helping someone in need: we are tapping into that \"I Will Be\" statement that God shared with Moses. We are proving that our identity is not a finished product, but a constant process of growth. By refusing to look away from a problem, we become the authors of a future that does not have to look like the past. Our lives are shaped by the courage we show in moving toward the person we have the potential to become.\n\nI hope we can all find the strength to see the potential in ourselves and the world this week.\n\nWishing you a Shabbat Shalom and love you all,\n\nYair <3\n\n\nP.S. - I attached some photos from Argentina!!!"
    },
    {
      "id": "2026-01-09-shemot-yair-addendum",
      "parsha": "Shemot",
      "title": "God Equips the Called",
      "sharedOn": "2026-01-09",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "In his addendum, Yair highlights Moses' speech insecurity and argues that leadership is saying \"Hineni\" despite personal limitation and fear.",
      "fullText": "Hi friends, I wanted to add one last thing since I was really admiring a specific section of the parsha that I forgot to mention 😬…..\n\n\nWhen God first calls out to Moses from the burning bush, Moses doesn't immediately jump at the chance to lead. Instead, he is filled with self-doubt, arguing that he is not a \"man of words\" and that he is \"heavy of mouth and heavy of tongue.\"  It is very clear that Moses feels completely unfit for the mission. But God’s response to him is a powerful one. He asks Moses, \"Who gives humans speech? Who makes them dumb or deaf, seeing or blind? Is it not I?\" God is reminding Moses that his perceived weaknesses are not obstacles to his purpose. In fact, our limitations are often exactly what allow us to rely on something greater than ourselves.\n\n\nThis interaction teaches us that leadership is not about being perfect, polished, or having all the answers. Often, we hold ourselves back from making a difference because we feel \"not enough\" or unqualified. But the truth is that God doesn't call the equipped…. But rather He equips the called.\n\n\nLeadership is simply the willingness to say \"Hineni\"….Here I am… despite our fears and our flaws. When we stop focusing on our own inadequacies and start focusing on the task that needs to be done, we realize that our potential is far greater than we ever imagined. True impact comes from the courage to step forward exactly as we are (even tho it can be scary at times), trusting that we have everything we need to build the future and impact we want to see.\n\nShabbat shalom yall,\nYair <3"
    },
    {
      "id": "2026-01-09-shemot-naama",
      "parsha": "Shemot",
      "title": "Fear as Hierarchy and Moral Force",
      "sharedOn": "2026-01-09",
      "writtenBy": "Naama Ben-Dor",
      "sharedBy": "Naama Ben-Dor",
      "excerpt": "Naama maps three fears in Shemot (midwives, Moses, Pharaoh) and argues that fear of God can order other fears into moral clarity.",
      "fullText": "Dearest friends,\n\nIn the last email I shared with you all, I noted the importance of courage despite fear. But the events of this week’s parsha caused me to look at fear in a new light, and to consider two different ideas— namely, fear as hierarchy, and fear as a force for good.\nTo explain the first, I will first reference a quote from John Green’s book, The Fault in Our Stars, where he writes that “some infinities are larger than other infinities.” Green explains, for example, that while an infinite set of numbers exist between 0-1, there is an even greater infinity of numbers between 0-10. In this week’s parsha, I observed three notable instances of fear.\nThe first occurs when the Hebrew midwives, ordered by Pharaoh to kill the sons of Israelites, choose to ignore him. The text tells us that “the midwives, fearing God, did not do as the king of Egypt had told them; they let the boys live.” (Ex. 1:17)\n\nIn chapter three, God first speaks with Moses. We read that when God calls out to him, “Moses hid his face, for he was afraid to look at God.” (Ex. 3:6). Just a few verses later, God tells him that he “shall free My people, the Israelites, from Egypt,” to which Moses responds, “Who am I that I should go to Pharaoh and free the Israelites from Egypt?” (Ex. 3:10-11). This is not the only time that Moses doubts his capabilities despite instructions from God. Perhaps most notably, Moses even begs God to “make someone else Your agent.” (Ex. 4:13).\n\nThe third instance of fear is that of Pharaoh’s. In his conversation with Moses, God tells him: “I know that the king of Egypt will let you go only because of a greater might. So I will stretch out My hand and smite Egypt with various wonders which I will work upon them; after that he shall let you go.” (Ex. 3:19-20). Essentially, God tells him that the only thing that might cause Pharoah to free the Israelites is a powerful fear of God’s wrath.\n\nOver the years when I have thought of God, the concept of fearing Him has been a complicated one for me to understand. One the one hand, we know that God created us in His image and that he loves us, and that we should love Him back. We are also told that He views us as partners in his creation, hence the formation of a covenant of mutual responsibility. Why, then, I wondered, would God want us to fear him? That is what this week’s parsha helped me understand. The events I quoted above demonstrate three instances in which overpowering Godly fear was used as a force for good. In the case of the midwives, their fear of God exceeded that of their fear of Pharaoh, enabling them to make the moral decision to protect the Israelite babies. In the case of Moses, his fear of God ultimately exceeded his fears of his incompetence. Despite his immense insecurities, he did as God instructed him, which eventually enables him (spoiler) to lead the Israelites out of Egypt. Lastly, God Himself tells us that he deliberately acts to instill an intense fear in Pharaoh such that he will surrender to the Israelites’ demands to let them go. These instances illustrate a common theme of fear as a hierarchy, wherein a fear of God that exceeds all else can be used as a source of moral clarity that orients us while making difficult decisions, and ultimately empowers us to choose to do good, however scary. Especially in these tumultuous times, when populations in places like Iran are risking their lives to overthrow their own dictator, or in Venezuela, where the people face an opportunity to topple the remnants of the Maduro regime, I pray that they can find strength and conviction in their fight against evil through an overpowering faith and fear in God.\nShabbat shalom to you all!\n(And enjoy the rest of your trip Yair and Erez!)\n\nWith love,\nNaama"
    },
    {
      "id": "2026-01-12-shemot-daniel",
      "parsha": "Shemot",
      "title": "Oppression Fails, Israel Endures",
      "sharedOn": "2026-01-12",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel underscores the opening dynamic of Exodus: oppression intensifies, yet the people multiply, survive, and carry history forward.",
      "fullText": "Hey everyone,\n\nSorry I wasn’t able to reply earlier--better late than never.\n\nI’m really excited to begin Exodus, perhaps the most important story of our people.\n\nRight at the start of the parasha, we see a terrifying shift in Egypt:\n\n“A new king arose over Egypt who did not know Joseph…\n‘Let us deal shrewdly with them, so that they may not increase…’\nSo they set taskmasters over them to oppress them with forced labor.”\n(Exodus 1:8–11)\n\nPharaoh’s response to fear is oppression, control, and attempted erasure. Good luck to him, though.\n\n“But the more they were oppressed, the more they increased and spread.”\n(Exodus. 1:12)\n\nWe are still here; they are not. The same is true of later attempts to destroy us, including WWII.\n\nGood luck to anyone who tries to exterminate the Jewish people. Shemot opens the door to the most famous story of that failure.\n\nBest,\nDaniel"
    },
    {
      "id": "2026-01-16-vaera-yair",
      "parsha": "Vaera",
      "title": "The God of History and the \"Not Yet\" Faith",
      "sharedOn": "2026-01-16",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair contrasts El Shaddai and the four-letter Name to frame covenant as God's presence in history, and faith as acting now for futures we may not see.",
      "fullText": "Dear Friends (Lorainey, Aidan, Avison, Naama, Danielson, Inbar, Aya, Alexander, and Erezatang), ‏\n\nI hope you are all having a great week. In our Torah portion this week, Parshat Vaera, we move into the heart of the struggle for freedom in Egypt. To give you a quick summary of the context: Moses is feeling very discouraged because his first attempt to speak to Pharaoh actually made things harder for the Jewish people. In response, God reassures Moses with the famous four expressions of redemption: \"I will bring you out,\" \"I will deliver you,\" \"I will redeem you,\" and \"I will take you.\" The parsha then describes the first seven of the ten plagues, including Blood, Frogs, and Hail, as the battle between Moses and Pharaoh begins to escalate. At the very beginning of the portion, God shares a deep secret with Moses about the nature of their relationship that changes how we view our own lives today:\nוָאֵרָ֗א אֶל־אַבְרָהָ֛ם אֶל־יִצְחָ֥ק וְאֶֽל־יַעֲקֹ֖ב בְּאֵ֣ל שַׁדָּ֑י וּשְׁמִ֣י יְהֹוָ֔ה לֹ֥א נוֹדַ֖עְתִּי לָהֶֽם׃\n\n\"I appeared to Abraham, Isaac, and Jacob as E-l Shadd-ai, but I did not make Myself known to them by My name Hashem.\" (Exodus 6:3)\n\nRabbi Sacks has a fascinating explanation on this change of names that I really found interesting. He explains that the Patriarchs knew God as E-l Shadd-ai, which refers to the God of “nature” and the power that runs the universe. This is God as the Creator of the stars and the laws of physics. However, in our parsha, God reveals a new name (which we do not say), represented by the four-letter name we refer to as Hashem, which represents being \"Present.\" This is the first time in history that people realized God isn't just a force in the distant sky, but a God of History who is essentially in the present with us.\n\nSacks teaches that God actually cares about what happens in the slave pits, in the streets, and in our personal \"now.\" Our relationship with the Divine is not about escaping the world to find peace: it is about realizing that God is an active partner in the middle of our most chaotic moments, and that it is why it is called a “covenant”.\n\n This new understanding of God was exactly what Moses needed to handle what Rabbi Sacks then later calls the \"Not Yet\" faith. Moses was being asked to lead a journey that he might not even see finish. Further…the Patriarchs lived their entire lives based on a promise of a land they never actually owned. They had the courage to act today because of a vision for a tomorrow they wouldn't experience themselves.\n\nBy revealing His \"Present\" name, God was telling Moses that even if the goal feels far away, the meaning of the work is found in the present moment. Faith is the courage to live with uncertainty, knowing that the God of History is with us while we try to create and fight for an unrealized future.\n\nThe takeaway for us this Shabbat, I believe, is that we should not wait for \"certainty\" or a guaranteed \"success\" before we decide to do the right thing. Acting with integrity in the present is how we keep the promises of the past alive and build a future for those who come after us.\n\nWhether we are working on a long-term project (like learning a new language, or trying to work-out more to improve our health) or just trying to be a better friend, we can find purpose in the struggle itself.\n\nWe are asked to be authors of history, making choices that reflect our values right now, even when we are still in the middle of the difficult parts of our journey.\n\nWishing you a Shabbat Shalom,\nYair <3"
    },
    {
      "id": "2026-01-16-vaera-naama",
      "parsha": "Vaera",
      "title": "When Suffering Clouds Hearing",
      "sharedOn": "2026-01-16",
      "writtenBy": "Naama Ben-Dor",
      "sharedBy": "Naama Ben-Dor",
      "excerpt": "Naama reflects on \"they did not listen because of crushed spirit\" and explores emotional bondage, free will, and the work of reclaiming clarity.",
      "fullText": "Dearest Friends,\n\nShabbat Shalom! In this week's parsha, we read mostly of the interactions between Moses and God, Moses and Aaron, and Moses and Aaron with Pharaoh. The bulk of these verses recount the infamous stories of the plagues that we recite every Passover. Within the text, however, we read very briefly about an interaction between Moses and the Israelites--- an interaction so short and seemingly insignificant, that I probably would have skimmed over it had I not heard the D'var Torah of one of my closest friends, Kinneret, at mechina four years ago. Her words resonated so deeply with me that I remember them to this day, and wanted to share her message with you, as well.\n\nVa'era begins with God speaking to Moses, as Yair beautifully describes. After telling Moses His name, God expresses that he has \"heard the moaning of the Israelites because the Egyptians are holding them in bondage\" (Exodus 6:5). In response to these cries of suffering, He then instructs Moses to relay a message of hope to the Israelites, informing them that God will free them from bondage and return them to their homeland. Despite what we might expect from a people suddenly informed of their imminent liberation, we read that \"when Moses told this to the Israelites, they would not listen to Moses, their spirits crushed by cruel bondage.\" (Exodus 6:9).\nThe reaction of the Israelites, though perhaps surprising at first glance, is not all that unusual. If we only analyze this behavior with the perspective of outsiders who already know of the Israelites' ultimately successful escape, their response appears ignorant and even disrespectful towards God. But if we place ourselves in their shoes, their reaction doesn't appear nearly as irrational. Speaking for myself, when I consider all the lowest moments in my life, one common theme that stands out among those memories is the sense of a cloud of negativity that took hold of me, warped my perceptions, and governed my emotions. When the Israelites received God's message, their judgements were clouded and instead of recognizing His words as a source of hope, they \"would not listen.\"\n\nAs sentient beings, we are privileged to experience not only physical sensations in this world, but also deeper, emotional ones. This capacity, though perhaps one of the characteristics that make us most uniquely human and that enable us to feel our greatest joys, is also capable of dragging us into intense pain and despair. Considering the Israelites' response with hindsight, we can acknowledge that their negativity and hopelessness served not as a means for improvement but rather as a barrier to it. While, B\"H, we are no longer slaves in Egypt, we face countless disappointments and difficulties in our own lives on a daily basis, and it is easy to let these moments take hold of us and influence our thinking and decision-making--- when we do so, however, we effectively become enslaved by our emotions. Instead, we must fight this instinct through a confidence in our free will, which is one of (if not the) core tenets of Judaism, and through a confidence in God's will. As we saw with the Israelites, their hopeless analysis of their situation was faulty; by contrast, God's message came to fruition. This lesson teaches us to recognize when we are clouded by strong emotion, to work to step out of it--- hard as it might be--- and to ground ourselves in our faith in ourselves and in our faith in God.\n\nWishing everyone a Shabbat Shalom!\nNaama"
    },
    {
      "id": "2026-01-23-bo-yair",
      "parsha": "Bo",
      "title": "\"Come\" to Pharaoh and the Work of Memory",
      "sharedOn": "2026-01-23",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair reads \"Bo el Paroh\" as divine accompaniment into darkness and ties \"V'higadta l'vincha\" to transgenerational resilience and identity.",
      "fullText": "Dear Friends (Lorainey, Aidan, Avison, Naama, Danielson, Inbar, Aya, Fisher, Bar, Shore, and Erezatang),\n\nFirst of all, I wanted to say how happy I am that the list of people in our weekly Shabbat family has grown! Welcome to Fisher, Aya, Bar, and Shore!\n\nWe have finally reached the climax of the Exodus story. After months of warnings and plagues, the Egyptian empire is on the verge of collapse. You would think that by this point, Moses would be moving with total confidence. He has seen the Nile turn to blood and the sky rain fire. Yet, as our Parsha begins, there is a strange hesitation in the air. Before the eighth plague, God gives Moses a command that contains a very odd choice of words.... that is not really seen unless you read in the original, and holy Hebrew native tongue. Usually, when you send someone on a mission, you tell them to \"go or לך.\" But that is not what God says here.\n\nוַיֹּ֤אמֶר יְהֹוָה֙ אֶל־מֹשֶׁ֔ה בֹּ֖א אֶל־פַּרְעֹ֑ה\n\"Vayomer Adonai el Moshe: Bo el Par'oh.\"\n\"Then the Lord said to Moses: Come (in the english translation it says 'Go') to Pharaoh.\" (Exodus 10:1)\n\nThe Midrash and many of our great commentators notice this linguistic pivot immediately. Why \"Come\" and not \"Go\"? If Moses is at the burning bush or in the desert and Pharaoh is in his palace, the correct command should be Lech (לך), go there. But the Torah is teaching us something deep about the nature of God's presence. As explained in the commentary, Pharaoh had reached a level of such intense arrogance that he believed he was a god. Moses was terrified to enter that space of ego and power. By saying \"Come,\" God was revealing a life-changing secret: God is everywhere, even in the heart of the darkness. God wasn't sending Moses to a destination.... but rather, He was inviting Moses to join Him at that destination.\n\nThis idea of partnership leads us to the most unique part of the Parsha. At the very moment of liberation, when any other leader would be talking about military strategy or political borders, Moses starts talking about something totally unexpected... \"children\".\n\nוְהִגַּדְתָּ֣ לְבִנְךָ֔ בַּיּ֥וֹם הַה֖וּא לֵאמֹ֑ר בַּעֲב֣וּר זֶ֗ה עָשָׂ֤ה יְהֹוָה֙ לִ֔י בְּצֵאתִ֖י מִמִּצְרָֽיִם\n\"V'higadta l'vincha bayom hahu lemor: ba'avur zeh asah Adonai li be'tzeti mi'Mitzrayim.\"\n\"And you shall explain to your child on that day, 'It is because of what the Lord did for me when I went free from Egypt.'\" (Exodus 13:8)\n\nRabbi Sacks always noted that Moses didn't celebrate the moment of liberation by building a monument. Instead, he wanted to ensure it would form part of the people's memory until the end of time. He wanted parents to become educators. A form of \"Teaching and Passing the Resilience.\" There is a really cool study by Dr. Marshall Duke and Dr. Robyn Fivush from Emory University that I think aligns quite nicely. They found that the single most important predictor of a child's emotional health and resilience was knowing their family narrative. They asked children things like: Do you know where your grandparents grew up? Do you know about a challenge your family overcame?\n\nThe researchers discovered that children who knew their \"intergenerational story\" had a much higher sense of self-esteem and control over their lives. Why? Because when a child knows they belong to a story of people who survived, struggled, and ultimately triumphed, they realize that they, too, have the \"with-ness\" of their ancestors and God behind them. They aren't just an \"I\"...they are part of a \"We.\"\n\nThis insight shifts the way we look at our own challenges. We often feel like we have to find the strength within ourselves to \"go (ללכת)\" and face the giants in our lives alone. But the message of Bo el Par'oh and V'higadta l'vincha is that our identity is our greatest armor. Whether it is starting a new project, standing up for a friend, or trying to change a bad habit, we aren't being sent into a vacuum. We are stepping into a reality where the potential for good is already waiting for us, supported by the stories of those who came before.\n\nWhen we act with kindness or work to build our community, we are essentially walking into the palace with a Partner and a History. We are never just \"sent\" to do good...we are invited to join a mission that began long before us and will continue long after (ב׳׳ה). If we can remember that we never walk alone, then there is no conversation too difficult to have and no shadow too dark to enter. This Shabbat, let's try to find that one place we've been afraid to \"go\" and remember that we are actually being invited to \"come\" and make a difference together."
    },
    {
      "id": "2026-01-23-bo-erez",
      "parsha": "Bo",
      "title": "Bo vs Lech: Receiving vs Drifting",
      "sharedOn": "2026-01-23",
      "writtenBy": "Erez Yarden",
      "sharedBy": "Erez Yarden",
      "excerpt": "Erez offers a linguistic reading: \"bo\" conveys arrival into decisive consequence, while \"lech\" suggests open-ended movement.",
      "fullText": "Hi all!\n\nI think this debate over Bo בא, and Lech לך is an interesting one. It seems like to come forth (Bo) is to go towards something result oriented. And to go (לך) is to drift until you hit some sort of change. Especially if you look past the biblical story and into today's world.\n\nWhen I was growing up and I would get into trouble my parents would always tell me ״בואנה״ (Bo-Ehnah) or to come here, because I was going to be receiving my lesson or some punishment. They don't say לך אלי (Lech Elai) or go to me. And on the other hand, when you give someone directions you tell them ללכת (L'lechet) to go towards something until they can see it. Essentially telling them, drift until something changes. You would not tell them to בא לשם (Bo L'sham).\n\nSo as I see it, בא was the perfect word used because it tells Moses that he shall be receiving something. Potentially, what he has fighting for this whole time or it could have been a punishment from the Pharaoh. But either way Moses was going to be receiving something. And in our story, we can see with hindsight that he was going to be receiving that start of our freedom.\n\nI hope you all enjoyed my thoughts.\n\nSmell ya later,\nErez Yarden"
    },
    {
      "id": "2026-01-23-bo-naama",
      "parsha": "Bo",
      "title": "A Sign for You",
      "sharedOn": "2026-01-23",
      "writtenBy": "Naama Ben-Dor",
      "sharedBy": "Naama Ben-Dor",
      "excerpt": "Naama interprets the doorpost blood as identity formation: not God needing information, but Israel needing conscious, outward commitment to peoplehood.",
      "fullText": "Dear Friends (old and new!),\n\nI won't bother you with a long email today (apologies for last week, I got carried away!) and I really enjoyed reading both Yair and Erez's thoughts.\nI just wanted to share one small detail from this week's parsha that stood out to me. Among with the rest of the instructions that God gives Moses and Aaron to relate to the Israelites, He makes one request that I found particularly interesting:\n\n(Exodus 12:13)\nוְהָיָה֩ הַדָּ֨ם לָכֶ֜ם לְאֹ֗ת עַ֤ל הַבָּתִּים֙ אֲשֶׁ֣ר אַתֶּ֣ם שָׁ֔ם וְרָאִ֙יתִי֙ אֶת־הַדָּ֔ם וּפָסַחְתִּ֖י עֲלֵכֶ֑ם וְלֹֽא־יִֽהְיֶ֨ה בָכֶ֥ם נֶ֙גֶף֙ לְמַשְׁחִ֔ית בְּהַכֹּתִ֖י בְּאֶ֥רֶץ מִצְרָֽיִם׃\n\"And the blood on the houses where you are staying shall be a sign for you: when I see the blood I will pass over you, so that no plague will destroy you when I strike the land of Egypt.\"\n\nIn these lines, God asks for the Israelites to eat lamb and smear its blood on their houses, so that God will skip them when exacting His punishment of the death of firstborn sons. I initially did a double take when I read this line, because I wondered why an all-knowing, all-powerful god would need the Israelites to identify themselves; after all, wouldn't the Master of the Universe know who He created and who His people are? After looking closer at the text, though, I noticed something. It says \"וְהָיָה֩ הַדָּ֨ם לָכֶ֜ם לְאֹ֗ת עַ֤ל הַבָּתִּים\" or in English, \"the blood... shall be a sign for you.\"\n\nI am no Torah scholar but this seems like a deliberate choice of words to me. God was not asking the people to identify their homes because He did not know who the Israelites were; He asked them to identify their homes in order to ensure that the Israelites knew who they were. This request was an invitation to identify with their people and profess their shared faith and peoplehood. This concept of actions that require us to distinguish ourselves as Jews and, in doing so, to reinforce our active choice to be Jewish, is one that has been crucial over Jewish history in maintaining our sense of peoplehood and shared identity (ex., customs like circumcision, observing Shabbat, etc.).\n\nIf there was a way to plot hostility against the Jewish people over the centuries, I'm sure it would look something like a sine graph --- and I imagine that we are currently on an upwards trajectory. So how does this relate to this week's parsha? When the Israelites were facing cruelty and persecution by the Egyptians, God doesn't ask them to hide their identities and hibernate until He defeats Pharaoh. No: He instructs them to mark their homes--- to project their identity outwards. The Israelites needed to bring their identity into their consciousness, to make the voluntary, deliberate choice to belong to עם ישראל (Am Yisrael) and to do so unapologetically. This resonates deeply with me when I think about the modern day situation. In the face of growing anti-Jewish rhetoric and behavior, we mustn't fall for the myth that by hiding our Jewish identity or surrendering certain aspects of our beliefs, we will somehow regain the world's favor (this is really eloquently explained by Einat Wilf in her article \"The BDS Pound of Flesh\" --- I read it two years ago and never stopped thinking about it!). This week's parsha reminds us to wear our Star of David with pride, not to hesitate when asked where we're from, and to choose to be Jewish not only internally but also externally.\n\nI guess this email wasn't as short as I thought it would be but you know me; I'm a skilled yapper and I got swept into it again! Anyways, Good Shabbos to you all and welcome to all the newcomers :).\n\nבאהבה,\nNaama"
    },
    {
      "id": "2026-01-23-bo-daniel",
      "parsha": "Bo",
      "title": "Apology vs Repentance",
      "sharedOn": "2026-01-23",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel examines Pharaoh's repeated confessions and argues that pain-avoidance language is not teshuvah without real change of character.",
      "fullText": "Dear Family,\n\nI hope you had a great week. We have one heck of a weekend coming up.\n\nOne thing that really stood out to me in this week's Parasha is that Pharaoh appears to negotiate and apologize, yet the punishment continues.\n\n(See Exodus 10:3 - 10:17)\n...\nPharaoh hurriedly summoned Moses and Aaron and said, \"I stand guilty before the ETERNAL your God and before you.\nForgive my offense just this once, and plead with the ETERNAL your God that this death but be removed from me.\"\n\nAnd yet, despite these words, he continues to get punished. But why?\n\nPharaoh uses the right words (\"I stand guilty\"), but the context reveals that his apology is not sincere. It is the equivalent of not being sorry for what you did, but only being sorry you were caught.\nWhen we look at the end of his plea, he says, \"plead with the ETERNAL your God that this death be removed from me.\" This reveals his true motivation.\nHis goal is not a relationship with God or a change in moral direction; his goal is simply pain relief. He wants the locusts gone so he can continue to rule exactly as he did before.\n\nThis creates a fascinating, albeit tragic, cycle: as soon as the plague stops and the pressure is lifted, Pharaoh immediately goes back to his old ways.\nIt forces us to ask: is an apology real if it only happens when the consequences become unbearable?\nThe text suggests that true repentance requires a change of character, not just a desire for the suffering to end; this is precisely why they continue to be punished.\n\nA person who requires a stick to stop doing bad, or a carrot to start doing good, is not virtuous--they are merely trained.\n\nOr another way to think about it is Aristotle's external vs internal motivations.\n\nStay safe this weekend!\n\nBest,\nDaniel"
    },
    {
      "id": "2026-01-30-beshalach-yair",
      "parsha": "Beshalach",
      "title": "Atzmot and the Courage of \"What Is It?\"",
      "sharedOn": "2026-01-30",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair links Joseph's bones (atzmot / essence) and manna's ambiguity to a two-part resilience: carry memory, and trust daily provision without full certainty.",
      "fullText": "Dear My Dearest Friends (Lorainey, Mr. Schurr, Avison, Naama, Danielson, Inbar, Aya, Alexander, Bar, and Erezatang),\n\nThis week, we're diving into Parshat Beshalach, which is essentially the cinematic climax of the Exodus story. We're talking about the moment everything changes. After centuries of back-breaking slavery, Pharaoh finally lets us go....but then, in classic Pharaoh aura, he changes his mind. He sends his chariots racing after the people, and suddenly, the Israelites are trapped. They've got the Egyptian army breathing down their necks and the Sea of Reeds blocking their way.\n\nThen, the miracle happens. The sea splits, we cross on dry land, and the pursuit is finally over. The rest of the Parsha follows those first, uncertain steps into the desert: the Song of the Sea, the struggle for food and water, the \"Manna\", and that final, surprise attack by Amalek.\n\nBut in the middle of all this high-stakes chaos (the running, the fear, the miracles), the Torah pauses on a detail that I felt was totally out of place. It tells us that Moses took the bones of Joseph with him.\n\nThink about that for a second. When you're running for your life, the last thing you usually grab is a coffin. It's heavy, it's uncomfortable, and you're trying to move fast. But the Torah is very specific:\n\nוַיִּקַּח מֹשֶׁה אֶת-עַצְמוֹת יוֹסֵף עִמּוֹ\n\"Vayikach Moshe et-atzmot Yosef immo.\"\n\"And Moses took the bones of Joseph with him.\" (Exodus 13:19)\n\nTo understand why this mattered so much, we have to look at the Hebrew. The word for \"bones\" is Atzmot. But in Hebrew, that same root--עצם--is the word for \"essence\" or \"self.\" When Moses carries Joseph's bones, he isn't just doing a funeral service. He is carrying the essence of our story.\n\nHundreds of years before this, Joseph made his brothers promise that when the time for freedom finally came, they wouldn't leave him behind in Egypt. Moses realized something profound... if we left our past in Egyptian soil, we would arrive in the desert as refugees, but if we carried our history with us, we would arrive as a nation.\n\nI couldn't stop thinking about this when the news broke this week that the body of Ran Gvili (ז״ל) was finally brought home. For 843 days (two and a half years) he was held in Gaza. For 843 days, an entire nation refused to turn the page. Prime Minister Netanyahu said it perfectly: \"He went in first, and he came out last.\"\n\nThere is something deeply Beshalach about this moment. It reminds us that even when the \"chaos\" of the headlines and news outlets subsides, we are a people who do not leave our \"bones\" behind. The mission to find Ran wasn't just a military operation... it was a spiritual one. It was a refusal to let a single essence, a single Atzma (soul and self) be forgotten in enemy territory.\n\nJust as Moses carried Joseph's bones through the desert, the Jewish people carry their fallen with them through history. We do not let the narrative of \"moving on\" erase those who came before. We carry them, even when it is heavy, even when it is inconvenient, even when the Egyptian army is at our backs.\n\nThis Shabbat, as we read Beshalach and think about what it means to be truly free, let us remember that freedom is not just about where we are going. It is also about who we refuse to leave behind.\n\nWishing you a Shabbat Shalom,\nYair <3"
    },
    {
      "id": "2026-01-30-beshalach-daniel",
      "parsha": "Beshalach",
      "title": "Historical Echoes in Egypt",
      "sharedOn": "2026-01-30",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel shares archaeological material from Tell el-Dab'a as a provocative historical parallel to Joseph-era narratives."
    },
    {
      "id": "2026-02-06-yitro-yair",
      "parsha": "Yitro",
      "title": "Sinai in the Singular",
      "sharedOn": "2026-02-06",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair highlights the singular grammar of the first commandment to argue Sinai was personal as well as national: covenant as living partnership and responsibility."
    },
    {
      "id": "2026-02-06-yitro-bar",
      "parsha": "Yitro",
      "title": "Covenant as Ongoing Mutual Obligation",
      "sharedOn": "2026-02-06",
      "writtenBy": "Bar Shir",
      "sharedBy": "Bar Shir",
      "excerpt": "Bar reinforces that Sinai is not past tense but continuous, and frames Jewish life as active partnership in preparing the world for redemption."
    },
    {
      "id": "2026-02-06-yitro-aidan",
      "parsha": "Yitro",
      "title": "The Cypress Tree (Poetic Dvar)",
      "sharedOn": "2026-02-06",
      "writtenBy": "Aidan Schurr",
      "sharedBy": "Aidan Schurr",
      "excerpt": "Aidan's poem presents Sinai as collective memory and present responsibility, weaving longing for Eretz Yisrael with covenantal perseverance."
    },
    {
      "id": "2026-02-06-yitro-daniel",
      "parsha": "Yitro",
      "title": "Commandments, Telos, and Human Purpose",
      "sharedOn": "2026-02-06",
      "writtenBy": "Daniel Stone",
      "sharedBy": "Daniel Stone",
      "excerpt": "Daniel uses Aristotelian telos to argue humans need divine instruction to know the good, and reads the commandments as purpose-disclosure, not mere rule-set."
    },
    {
      "id": "2026-02-13-mishpatim-yair",
      "parsha": "Mishpatim",
      "title": "Na'aseh V'Nishma: Action Before Full Understanding",
      "sharedOn": "2026-02-13",
      "writtenBy": "Yair Ben Dor",
      "sharedBy": "Yair Ben Dor",
      "excerpt": "Yair frames Na'aseh V'Nishma as experiential wisdom: moral and spiritual understanding often follows commitment, not the other way around."
    },
    {
      "id": "2026-02-13-mishpatim-bar",
      "parsha": "Mishpatim",
      "title": "Doing as the Path to Understanding",
      "sharedOn": "2026-02-13",
      "writtenBy": "Bar Shir",
      "sharedBy": "Bar Shir",
      "excerpt": "Bar develops a complementary reading: mitzvah performance and understanding are not sequentially opposed, but mutually reinforcing."
    },
    {
      "id": "2026-02-13-mishpatim-naama",
      "parsha": "Mishpatim",
      "title": "Moral Memory and Compassionate Obligation",
      "sharedOn": "2026-02-13",
      "writtenBy": "Naama Ben-Dor",
      "sharedBy": "Naama Ben-Dor",
      "excerpt": "Naama emphasizes repeated commands not to oppress the stranger, and reads Mishpatim as a call to convert personal suffering into ethical action."
    },
    {
      "id": "2026-02-13-mishpatim-aidan",
      "parsha": "Mishpatim",
      "title": "The Palm Bride (Poetic Dvar)",
      "sharedOn": "2026-02-13",
      "writtenBy": "Aidan Schurr",
      "sharedBy": "Aidan Schurr",
      "excerpt": "Aidan's paired poems imagine covenantal longing as bride and groom, presenting mitzvah observance as patient love and national-spiritual return."
    }
  ]
}
